<template>
  <h1 class="title">В этом приложении</h1>
  <ul class="list-items">
    <li>🔥 Composition API + Vue 3;</li>
    <li>🔥 TypeScript + сервисы;</li>
    <li>Работа с API по техлогии REST;</li>
    <li>Хранение данных полученных от сервера;</li>
    <li>Полная настройка шаблона на Vue CLI + TypeScript;</li>
    <li>Установка и настройка Vue-router для Vue.js 3 + TypeScript;</li>
    <li>Настройка общего конфига для TypeScript;</li>
  </ul>
  <br />
  <h2 class="title" style="font-size: 22px">И мелочи:</h2>
  <ul class="list-items">
    <li>Знакомство с сервисами и разделение логики и UI на отдельные файлы;</li>
    <li>Интеграция TS в базовый шаблон vue cli;</li>
    <li>Спиннер UI, который можно переиспользовать в любом проекте.</li>
  </ul>
</template>
